rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Sar_Ip.c
#if (ADC_SAR_IP_HAS_CTU && (STD_ON == ADC_SAR_IP_EOCTU_ENABLED) && (STD_ON == ADC_SAR_IP_EOC_ENABLED))
static inline void Adc_Sar_CheckAndCallEoctuNotification(const uint32 Instance);
#endif

#if (STD_ON == ADC_SAR_IP_EOC_ENABLED)
static inline void Adc_Sar_CheckAndCallEocNotification(uint32 Instance,
                                                       uint16 ChanIdx,
                                                       uint16 VectAdr,
                                                       uint32 EocFlag,
                                                       boolean * CeocfrFlag);
#endif /* (STD_ON == ADC_SAR_IP_EOC_ENABLED) */

#if (STD_ON == ADC_SAR_IP_WDG_ENABLED)
static inline uint32 Adc_Sar_CheckAndCallWorrNotification(uint32 Instance,
                                                          uint16 ChanIdx,
                                                          uint16 VectAdr);
#endif /* (STD_ON == ADC_SAR_IP_WDG_ENABLED) */

#if ((STD_ON == ADC_SAR_IP_WDG_ENABLED) || (STD_ON == ADC_SAR_IP_EOC_ENABLED))
static inline void Adc_CheckAndCallAllChannelNotification(const uint32 Instance);
#endif /* ((STD_ON == ADC_SAR_IP_WDG_ENABLED) || (STD_ON == ADC_SAR_IP_EOC_ENABLED)) */

#if (ADC_SAR_IP_EXTERNAL_TRIGGER_ENABLE)
#if (FEATURE_ADC_HAS_INJ_EXT_TRIGGER || FEATURE_ADC_HAS_EXT_TRIGGER)
static inline void Adc_Sar_ConfigExternalTrigger(const uint32 Instance,
                                                 const Adc_Sar_Ip_ExtTriggerEdgeType TriggerEdge,
                                                 const uint32 TrgEdgeSetMask,
                                                 const uint32 TrgEdgeClrMask,
                                                 const uint32 TrigSrcMask);
#endif /* (FEATURE_ADC_HAS_INJ_EXT_TRIGGER || FEATURE_ADC_HAS_EXT_TRIGGER) */
#endif /* (ADC_SAR_IP_EXTERNAL_TRIGGER_ENABLE) */

#if ADC_SAR_IP_HAS_TEMPSENSE_CHN
#if (ADC_SAR_IP_TEMPSENSE_ENABLED == STD_ON)
static inline uint32 Adc_Sar_TempsenseConvFp2Int(const uint32 FloatingPoint);
static inline uint16 Adc_Sar_TempsenseConvInt2Fp(const sint32 SignedInteger);
#endif /* (ADC_SAR_IP_TEMPSENSE_ENABLED == STD_ON) */
#endif /* ADC_SAR_IP_HAS_TEMPSENSE_CHN */

static inline void Adc_Sar_SetNormalChain(const uint32 Instance,
                                          const uint32 * const Mask);
static inline void Adc_Sar_SetInjectedChain(const uint32 Instance,
                                            const uint32 * const Mask);

/* The function is used to reduce complexity for parent function */
static inline uint32 Adc_Sar_GetValueFromBool(const boolean bVal,
                                              const uint32 TrueVal,
                                              const uint32 FalseVal);

static inline Adc_Sar_Ip_StatusType Adc_Sar_CalibrationClkRestore(const uint32 u32Instance, 
                                                                     volatile uint32 * MCRAddr,
                                                                     uint32 McrSavedValue);
static inline Adc_Sar_Ip_StatusType Adc_Sar_CalibrationClkSelect(const uint32 u32Instance, 
                                                                    volatile uint32 * MCRAddr,
                                                                    uint32* McrSavedValue);
#if (STD_ON == ADC_SAR_IP_SELFTEST_ENABLED)
static inline Adc_Sar_Ip_StatusType Adc_Sar_CheckTimeoutStatus(const uint32 ActualTimeout,
                                                               const uint32 ExpectTimeout);
#endif /* (STD_ON == ADC_SAR_IP_SELFTEST_ENABLED) */

/*==================================================================================================
*                                       LOCAL FUNCTIONS
==================================================================================================*/


/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_Powerup
 * Description   : Turning on power to the analog portion of ADC
 *
 *END*************************************************************************/
static inline void Adc_Sar_Powerup(const uint32 Instance)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    SAR_ADC_AE_Type * AdcAEBasePtr = NULL_PTR;
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */

#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    if (Instance >= ADC_INSTANCE_COUNT)
    {
        AdcAEBasePtr = Adc_Sar_AE_Ip_apxAdcBase[Instance - ADC_INSTANCE_COUNT];
        AdcAEBasePtr->MCR &= ~(ADC_MCR_PWDN(1u));
    }
    else
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
        AdcBasePtr->MCR &= ~(ADC_MCR_PWDN(1u));
    }
}


/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_Powerdown
 * Description   : Turning off power to the analog portion of ADC
 *
 *END*************************************************************************/
static inline void Adc_Sar_Powerdown(const uint32 Instance)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    SAR_ADC_AE_Type * AdcAEBasePtr = NULL_PTR;
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */

#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    if (Instance >= ADC_INSTANCE_COUNT)
    {
        AdcAEBasePtr = Adc_Sar_AE_Ip_apxAdcBase[Instance - ADC_INSTANCE_COUNT];
        AdcAEBasePtr->MCR |= ADC_MCR_PWDN(1u);
    }
    else
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
        AdcBasePtr->MCR |= ADC_MCR_PWDN(1u);
    }
}


/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_WriteThresholds
 * Description   : Write Watchdog low, high thresholds for a wdog register
 *
 *END*************************************************************************/
static inline void Adc_Sar_WriteThresholds(const uint32 Instance,
                                           const uint8 RegisterNumber,
                                           const uint16 HighThreshold,
                                           const uint16 LowThreshold)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    SAR_ADC_AE_Type * AdcAEBasePtr = NULL_PTR;
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
#if !ADC_SAR_IP_HAS_THRHLR_ARRAY
    volatile uint32 * THRHLR0Addr = NULL_PTR;
    volatile uint32 * THRHLR1Addr = NULL_PTR;
    volatile uint32 * THRHLR2Addr = NULL_PTR;
    volatile uint32 * THRHLR3Addr = NULL_PTR;
    volatile uint32 * THRHLR4Addr = NULL_PTR;
    volatile uint32 * THRHLR5Addr = NULL_PTR;
#if ((ADC_SAR_IP_THRHLR_COUNT > 6U) || FEATURE_ADC_HAS_APPLICATION_EXTENSION)
    volatile uint32 * THRHLR6Addr = NULL_PTR;
    volatile uint32 * THRHLR7Addr = NULL_PTR;
#if ((ADC_SAR_IP_THRHLR_COUNT > 8U) || FEATURE_ADC_HAS_APPLICATION_EXTENSION)
    volatile uint32 * THRHLR8Addr = NULL_PTR;
    volatile uint32 * THRHLR9Addr = NULL_PTR;
    volatile uint32 * THRHLR10Addr = NULL_PTR;
    volatile uint32 * THRHLR11Addr = NULL_PTR;
#if ((ADC_SAR_IP_THRHLR_COUNT > 12U) || FEATURE_ADC_HAS_APPLICATION_EXTENSION)
    volatile uint32 * THRHLR12Addr = NULL_PTR;
    volatile uint32 * THRHLR13Addr = NULL_PTR;
    volatile uint32 * THRHLR14Addr = NULL_PTR;
    volatile uint32 * THRHLR15Addr = NULL_PTR;
#endif /* ((ADC_SAR_IP_THRHLR_COUNT > 12U) || ...) */
#endif /* ((ADC_SAR_IP_THRHLR_COUNT > 8U) || ...) */
#endif /* ((ADC_SAR_IP_THRHLR_COUNT > 6U) || ...) */
#endif /* !ADC_SAR_IP_HAS_THRHLR_ARRAY */

#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    if (Instance >= ADC_INSTANCE_COUNT)
    {
        AdcAEBasePtr = Adc_Sar_AE_Ip_apxAdcBase[Instance - ADC_INSTANCE_COUNT];
    }
    else
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
    }

#if !ADC_SAR_IP_HAS_THRHLR_ARRAY
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    if (Instance >= ADC_INSTANCE_COUNT)
    {
        THRHLR0Addr = (volatile uint32 *)&(AdcAEBasePtr->THRHLR0);
        THRHLR1Addr = (volatile uint32 *)&(AdcAEBasePtr->THRHLR1);
        THRHLR2Addr = (volatile uint32 *)&(AdcAEBasePtr->THRHLR2);
        THRHLR3Addr = (volatile uint32 *)&(AdcAEBasePtr->THRHLR3);
        THRHLR4Addr = (volatile uint32 *)&(AdcAEBasePtr->THRHLR4);
        THRHLR5Addr = (volatile uint32 *)&(AdcAEBasePtr->THRHLR5);
        THRHLR6Addr = (volatile uint32 *)&(AdcAEBasePtr->THRHLR6);
        THRHLR7Addr = (volatile uint32 *)&(AdcAEBasePtr->THRHLR7);
        THRHLR8Addr = (volatile uint32 *)&(AdcAEBasePtr->THRHLR8);
        THRHLR9Addr = (volatile uint32 *)&(AdcAEBasePtr->THRHLR9);
        THRHLR10Addr = (volatile uint32 *)&(AdcAEBasePtr->THRHLR10);
        THRHLR11Addr = (volatile uint32 *)&(AdcAEBasePtr->THRHLR11);
        THRHLR12Addr = (volatile uint32 *)&(AdcAEBasePtr->THRHLR12);
        THRHLR13Addr = (volatile uint32 *)&(AdcAEBasePtr->THRHLR13);
        THRHLR14Addr = (volatile uint32 *)&(AdcAEBasePtr->THRHLR14);
        THRHLR15Addr = (volatile uint32 *)&(AdcAEBasePtr->THRHLR15);
    }
    else
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    {
        THRHLR0Addr = (volatile uint32 *)&(AdcBasePtr->THRHLR0);
        THRHLR1Addr = (volatile uint32 *)&(AdcBasePtr->THRHLR1);
        THRHLR2Addr = (volatile uint32 *)&(AdcBasePtr->THRHLR2);
        THRHLR3Addr = (volatile uint32 *)&(AdcBasePtr->THRHLR3);
        THRHLR4Addr = (volatile uint32 *)&(AdcBasePtr->THRHLR4);
        THRHLR5Addr = (volatile uint32 *)&(AdcBasePtr->THRHLR5);
#if (ADC_SAR_IP_THRHLR_COUNT > 6U)
        THRHLR6Addr = (volatile uint32 *)&(AdcBasePtr->THRHLR6);
        THRHLR7Addr = (volatile uint32 *)&(AdcBasePtr->THRHLR7);
#if (ADC_SAR_IP_THRHLR_COUNT > 8U)
        THRHLR8Addr = (volatile uint32 *)&(AdcBasePtr->THRHLR8);
        THRHLR9Addr = (volatile uint32 *)&(AdcBasePtr->THRHLR9);
        THRHLR10Addr = (volatile uint32 *)&(AdcBasePtr->THRHLR10);
        THRHLR11Addr = (volatile uint32 *)&(AdcBasePtr->THRHLR11);
#if (ADC_SAR_IP_THRHLR_COUNT > 12U)
        THRHLR12Addr = (volatile uint32 *)&(AdcBasePtr->THRHLR12);
        THRHLR13Addr = (volatile uint32 *)&(AdcBasePtr->THRHLR13);
        THRHLR14Addr = (volatile uint32 *)&(AdcBasePtr->THRHLR14);
        THRHLR15Addr = (volatile uint32 *)&(AdcBasePtr->THRHLR15);
#endif /* (ADC_SAR_IP_THRHLR_COUNT > 12U) */
#endif /* (ADC_SAR_IP_THRHLR_COUNT > 8U) */
#endif /* (ADC_SAR_IP_THRHLR_COUNT > 6U) */
    }
#endif /* ADC_SAR_IP_HAS_THRHLR_ARRAY */

#if ADC_SAR_IP_HAS_THRHLR_ARRAY
#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(RegisterNumber < ADC_SAR_IP_THRHLR_COUNT);
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */
    uint32 Value = ADC_THRHLR_THRH(HighThreshold) |
                     ADC_THRHLR_THRL(LowThreshold);
    AdcBasePtr->THRHLR[RegisterNumber] = Value;

#else /* ADC_SAR_IP_HAS_THRHLR_ARRAY == 0 */

    uint32 Value = ADC_THRHLR0_THRH(HighThreshold) |
                     ADC_THRHLR0_THRL(LowThreshold);
    switch (RegisterNumber)
    {
        case 0:
            *THRHLR0Addr = Value;
            break;
        case 1:
            *THRHLR1Addr = Value;
            break;
        case 2:
            *THRHLR2Addr = Value;
            break;
        case 3:
            *THRHLR3Addr = Value;
            break;
        case 4:
            *THRHLR4Addr = Value;
            break;
        case 5:
            *THRHLR5Addr = Value;
            break;
#if ((ADC_SAR_IP_THRHLR_COUNT > 6U) || FEATURE_ADC_HAS_APPLICATION_EXTENSION)
        case 6:
            *THRHLR6Addr = Value;
            break;
        case 7:
            *THRHLR7Addr = Value;
            break;
#if ((ADC_SAR_IP_THRHLR_COUNT > 8U) || FEATURE_ADC_HAS_APPLICATION_EXTENSION)
        case 8:
            *THRHLR8Addr = Value;
            break;
        case 9:
            *THRHLR9Addr = Value;
            break;
        case 10:
            *THRHLR10Addr = Value;
            break;
        case 11:
            *THRHLR11Addr = Value;
            break;
#if ((ADC_SAR_IP_THRHLR_COUNT > 12U) || FEATURE_ADC_HAS_APPLICATION_EXTENSION)
        case 12:
            *THRHLR12Addr = Value;
            break;
        case 13:
            *THRHLR13Addr = Value;
            break;
        case 14:
            *THRHLR14Addr = Value;
            break;
        case 15:
            *THRHLR15Addr = Value;
            break;
#endif /* ((ADC_SAR_IP_THRHLR_COUNT > 12U) || ...) */
#endif /* ((ADC_SAR_IP_THRHLR_COUNT > 8U) || ...) */
#endif /* ((ADC_SAR_IP_THRHLR_COUNT > 6U) || ...) */
        default:
            ; /* no-op */
            break;
    }
#endif /* ADC_SAR_IP_HAS_THRHLR_ARRAY */
}

#if (ADC_SAR_IP_HAS_CWSELR_UNROLLED == 1u)
/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_GetChannelWatchdogAddress
 * Description   : Returns the address of the specified CWSELR register
 *
 *END*************************************************************************/
static inline volatile uint32 * Adc_Sar_GetChannelWatchdogAddress(const uint32 Instance,
                                                                  const uint32 RegisterNumber)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    SAR_ADC_AE_Type * AdcAEBasePtr = NULL_PTR;
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    volatile uint32 * CwselrAddr = NULL_PTR;
#if (ADC_SAR_IP_HAS_CWSELR0 || FEATURE_ADC_HAS_APPLICATION_EXTENSION)
    volatile uint32 * CWSELR0Addr = NULL_PTR;
#endif /* (ADC_SAR_IP_HAS_CWSELR0 || FEATURE_ADC_HAS_APPLICATION_EXTENSION) */
#if (ADC_SAR_IP_HAS_CWSELR1 || FEATURE_ADC_HAS_APPLICATION_EXTENSION)
    volatile uint32 * CWSELR1Addr = NULL_PTR;
#endif /* (ADC_SAR_IP_HAS_CWSELR1 || FEATURE_ADC_HAS_APPLICATION_EXTENSION) */
#if (ADC_SAR_IP_HAS_CWSELR2 || FEATURE_ADC_HAS_APPLICATION_EXTENSION)
    volatile uint32 * CWSELR2Addr = NULL_PTR;
#endif /* (ADC_SAR_IP_HAS_CWSELR2 || FEATURE_ADC_HAS_APPLICATION_EXTENSION) */

#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    if (Instance >= ADC_INSTANCE_COUNT)
    {
        AdcAEBasePtr = Adc_Sar_AE_Ip_apxAdcBase[Instance - ADC_INSTANCE_COUNT];
        CWSELR0Addr = (volatile uint32 *)&(AdcAEBasePtr->CWSELR0);
        CWSELR1Addr = (volatile uint32 *)&(AdcAEBasePtr->CWSELR1);
        CWSELR2Addr = (volatile uint32 *)&(AdcAEBasePtr->CWSELR2);
    }
    else
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
#if ADC_SAR_IP_HAS_CWSELR0
        CWSELR0Addr = (volatile uint32 *)&(AdcBasePtr->CWSELR0);
#endif /* ADC_SAR_IP_HAS_CWSELR0 */
#if ADC_SAR_IP_HAS_CWSELR1
        CWSELR1Addr = (volatile uint32 *)&(AdcBasePtr->CWSELR1);
#endif /* ADC_SAR_IP_HAS_CWSELR1 */
#if ADC_SAR_IP_HAS_CWSELR2
        CWSELR2Addr = (volatile uint32 *)&(AdcBasePtr->CWSELR2);
#endif /* ADC_SAR_IP_HAS_CWSELR2 */
    }

    switch (RegisterNumber)
    {
#if (ADC_SAR_IP_HAS_CWSELR0 || FEATURE_ADC_HAS_APPLICATION_EXTENSION)
        case 0u:
            CwselrAddr = CWSELR0Addr;
            break;
#endif /* (ADC_SAR_IP_HAS_CWSELR0 || FEATURE_ADC_HAS_APPLICATION_EXTENSION) */
#if (ADC_SAR_IP_HAS_CWSELR1 || FEATURE_ADC_HAS_APPLICATION_EXTENSION)
        case 1u:
            CwselrAddr = CWSELR1Addr;
            break;
#endif /* (ADC_SAR_IP_HAS_CWSELR1 || FEATURE_ADC_HAS_APPLICATION_EXTENSION) */
#if (ADC_SAR_IP_HAS_CWSELR2 || FEATURE_ADC_HAS_APPLICATION_EXTENSION)
        case 2u:
            CwselrAddr = CWSELR2Addr;
            break;
#endif /* (ADC_SAR_IP_HAS_CWSELR2 || FEATURE_ADC_HAS_APPLICATION_EXTENSION) */
#if ADC_SAR_IP_HAS_CWSELR3
        case 3u:
            CwselrAddr = (volatile uint32 *)&(AdcBasePtr->CWSELR3);
            break;
#endif /* ADC_SAR_IP_HAS_CWSELR3 */
#if ADC_SAR_IP_HAS_CWSELR4
        case 4u:
            CwselrAddr = (volatile uint32 *)&(AdcBasePtr->CWSELR4);
            break;
#endif /* ADC_SAR_IP_HAS_CWSELR4 */
#if ADC_SAR_IP_HAS_CWSELR5
        case 5u:
            CwselrAddr = (volatile uint32 *)&(AdcBasePtr->CWSELR5);
            break;
#endif /* ADC_SAR_IP_HAS_CWSELR5 */
#if ADC_SAR_IP_HAS_CWSELR6
        case 6u:
            CwselrAddr = (volatile uint32 *)&(AdcBasePtr->CWSELR6);
            break;
#endif /* ADC_SAR_IP_HAS_CWSELR6 */
#if ADC_SAR_IP_HAS_CWSELR7
        case 7u:
            CwselrAddr = (volatile uint32 *)&(AdcBasePtr->CWSELR7);
            break;
#endif /* ADC_SAR_IP_HAS_CWSELR7 */
#if ADC_SAR_IP_HAS_CWSELR8
        case 8u:
            CwselrAddr = (volatile uint32 *)&(AdcBasePtr->CWSELR8);
            break;
#endif /* ADC_SAR_IP_HAS_CWSELR8 */
#if ADC_SAR_IP_HAS_CWSELR9
        case 9u:
            CwselrAddr = (volatile uint32 *)&(AdcBasePtr->CWSELR9);
            break;
#endif /* ADC_SAR_IP_HAS_CWSELR9 */
#if ADC_SAR_IP_HAS_CWSELR10
        case 10u:
            CwselrAddr = (volatile uint32 *)&(AdcBasePtr->CWSELR10);
            break;
#endif /* ADC_SAR_IP_HAS_CWSELR10 */
#if ADC_SAR_IP_HAS_CWSELR11
        case 11u:
            CwselrAddr = (volatile uint32 *)&(AdcBasePtr->CWSELR11);
            break;
#endif /* ADC_SAR_IP_HAS_CWSELR11 */
        default:
            ; /* the RegisterNumber does not exist */
#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
            DevAssert(FALSE);
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */
            break;
    }

    return CwselrAddr;
}
#endif /* ADC_SAR_IP_HAS_CWSELR_UNROLLED == 1 */

#if (STD_ON == ADC_SAR_IP_WDG_ENABLED)
/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_WriteChannelMapping
 * Description   :
 *
 *END*************************************************************************/
static inline void Adc_Sar_WriteChannelMapping(const uint32 Instance,
                                               const uint32 RegisterNumber,
                                               const uint32 FieldPosition,
                                               const uint32 Value)
{
    uint32 CwselrVal;
    uint32 CwselrMask;
    uint32 CwselrShift;

#if (ADC_SAR_IP_HAS_CWSELR_UNROLLED == 1u)
    volatile uint32 * Cwselr = Adc_Sar_GetChannelWatchdogAddress(Instance, RegisterNumber);

    /* Each CWSELR register contains 8 watchdog selections according to 8 channels
       Each watchdog selection possibly needs maximum 4 bits for setting */
    CwselrShift = FieldPosition * ADC_CWSELR0_WSEL_CH1_SHIFT;
    CwselrMask = (uint32)ADC_CWSELR0_WSEL_CH0_MASK << CwselrShift;
    CwselrVal  = (*Cwselr) & (~CwselrMask);
    CwselrVal |= ADC_CWSELR0_WSEL_CH0(Value) << CwselrShift;
    *Cwselr      = CwselrVal;
#else /* ADC_SAR_IP_HAS_CWSELR_UNROLLED == 0 */
    ADC_Type * const AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];

