rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Sar_Ip.c
    CwselrShift = FieldPosition * ADC_CWSELR_WSEL_CH1_SHIFT;
    CwselrMask = (uint32)ADC_CWSELR_WSEL_CH0_MASK << CwselrShift;
    CwselrVal  = CWSELR(AdcBasePtr, RegisterNumber) & (~CwselrMask);
    CwselrVal |= ADC_CWSELR_WSEL_CH0(Value) << CwselrShift;
    CWSELR(AdcBasePtr, RegisterNumber) = CwselrVal;
#endif /* (ADC_SAR_IP_HAS_CWSELR_UNROLLED == 1u) */
}
#endif /* (STD_ON == ADC_SAR_IP_WDG_ENABLED) */

static inline void Adc_Sar_ResetWdogCWSELR(const uint32 Instance, const uint8 RegisterNumber)
{
#if (ADC_SAR_IP_HAS_CWSELR_UNROLLED == 1u)
    volatile uint32 * Cwselr = Adc_Sar_GetChannelWatchdogAddress(Instance, (uint32)RegisterNumber);

    *Cwselr = 0U;
#else /* ADC_SAR_IP_HAS_CWSELR_UNROLLED == 0 */
    ADC_Type * const AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];

    CWSELR(AdcBasePtr, RegisterNumber) = 0u;
#endif /* (ADC_SAR_IP_HAS_CWSELR_UNROLLED == 1u) */
}

#if (STD_ON == ADC_SAR_IP_SELFTEST_ENABLED)
static inline Adc_Sar_Ip_StatusType Adc_Sar_CheckTimeoutStatus(const uint32 ActualTimeout,
                                                               const uint32 ExpectTimeout)
{
    Adc_Sar_Ip_StatusType RelValue = ADC_SAR_IP_STATUS_SUCCESS;
    /* Check if the timeout is not expected */
    if (ActualTimeout >= ExpectTimeout)
    {
        RelValue = ADC_SAR_IP_STATUS_TIMEOUT;
    }

    /* Return the value of ADC SAR status */
    return RelValue;
}
#endif /* (STD_ON == ADC_SAR_IP_SELFTEST_ENABLED) */

#if (ADC_SAR_IP_SET_RESOLUTION == STD_ON)
/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_GetResolution
 * Description   : Returns Adc Sar resolution for conversion data
 *
 *END*************************************************************************/
static inline uint8 Adc_Sar_GetResolution(const uint32 Instance)
{
    uint8 Resolution;
    static const uint8 ResolutionArray[] = {14U, 12U, 10U, 8U}; /* maps each register bit value to resolution bit number */
    const ADC_Type * const AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
    uint32 Calbistreg = AdcBasePtr->CALBISTREG;
    /* ResolutionArray can be used only for 2 bits resolutions. On S32K3 platforms only 2 bits are used so "& 3U" operation is needed */
    uint8 ResolutionBits = (uint8)(((Calbistreg & ADC_CALBISTREG_RESN_MASK) >> ADC_CALBISTREG_RESN_SHIFT) & 3U);

    Resolution = ResolutionArray[ResolutionBits];

    return Resolution;
}
#endif /* (ADC_SAR_IP_SET_RESOLUTION == STD_ON) */

#if (STD_ON == ADC_SAR_IP_SELFTEST_ENABLED)
/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_ConfigSelftestThreshold
 * Description   : Configure self-test threshold value
 *
 *END*************************************************************************/
static inline void Adc_Sar_ConfigSelftestThreshold(const uint32 Instance,
                                                   const Adc_Sar_Ip_SelfTestThresholdType * SelfTestThresholdConfig)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    SAR_ADC_AE_Type * AdcAEBasePtr = NULL_PTR;
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
#ifdef ADC_STAW0R_AWDE
    volatile uint32 * STAW0RAddr = NULL_PTR;
#endif /* ADC_STAW0R_AWDE */
#ifdef ADC_STAW1R_AWDE
    volatile uint32 * STAW1RAddr = NULL_PTR;
#endif /* ADC_STAW1R_AWDE */
#ifdef ADC_STAW1AR_AWDE
    volatile uint32 * STAW1ARAddr = NULL_PTR;
    volatile uint32 * STAW1BRAddr = NULL_PTR;
#endif /* ADC_STAW1AR_AWDE */
#ifdef ADC_STAW2R_AWDE
    volatile uint32 * STAW2RAddr = NULL_PTR;
#endif /* ADC_STAW2R_AWDE */
#ifdef ADC_STAW4R_AWDE
    volatile uint32 * STAW4RAddr = NULL_PTR;
    volatile uint32 * STAW5RAddr = NULL_PTR;
#endif /* ADC_STAW4R_AWDE */

#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    if (Instance >= ADC_INSTANCE_COUNT)
    {
        AdcAEBasePtr = Adc_Sar_AE_Ip_apxAdcBase[Instance - ADC_INSTANCE_COUNT];
#ifdef ADC_STAW0R_AWDE
        STAW0RAddr = (volatile uint32 *)&(AdcAEBasePtr->STAW0R);
#endif /* ADC_STAW0R_AWDE */
#ifdef ADC_STAW1R_AWDE
        STAW1RAddr = (volatile uint32 *)&(AdcAEBasePtr->STAW1R);
#endif /* ADC_STAW1R_AWDE */
#ifdef ADC_STAW1AR_AWDE
        STAW1ARAddr = (volatile uint32 *)&(AdcAEBasePtr->STAW1AR);
        STAW1BRAddr = (volatile uint32 *)&(AdcAEBasePtr->STAW1BR);
#endif /* ADC_STAW1AR_AWDE */
#ifdef ADC_STAW2R_AWDE
        STAW2RAddr = (volatile uint32 *)&(AdcAEBasePtr->STAW2R);
#endif /* ADC_STAW2R_AWDE */
#ifdef ADC_STAW4R_AWDE
        STAW4RAddr = (volatile uint32 *)&(AdcAEBasePtr->STAW4R);
        STAW5RAddr = (volatile uint32 *)&(AdcAEBasePtr->STAW5R);
#endif /* ADC_STAW4R_AWDE */
    }
    else
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
#ifdef ADC_STAW0R_AWDE
        STAW0RAddr = (volatile uint32 *)&(AdcBasePtr->STAW0R);
#endif /* ADC_STAW0R_AWDE */
#ifdef ADC_STAW1R_AWDE
        STAW1RAddr = (volatile uint32 *)&(AdcBasePtr->STAW1R);
#endif /* ADC_STAW1R_AWDE */
#ifdef ADC_STAW1AR_AWDE
        STAW1ARAddr = (volatile uint32 *)&(AdcBasePtr->STAW1AR);
        STAW1BRAddr = (volatile uint32 *)&(AdcBasePtr->STAW1BR);
#endif /* ADC_STAW1AR_AWDE */
#ifdef ADC_STAW2R_AWDE
        STAW2RAddr = (volatile uint32 *)&(AdcBasePtr->STAW2R);
#endif /* ADC_STAW2R_AWDE */
#ifdef ADC_STAW4R_AWDE
        STAW4RAddr = (volatile uint32 *)&(AdcBasePtr->STAW4R);
        STAW5RAddr = (volatile uint32 *)&(AdcBasePtr->STAW5R);
#endif /* ADC_STAW4R_AWDE */
    }

#ifdef ADC_STAW0R_AWDE
    /* Configure the self-test watchdog threshold for S0 algorithm */
    *STAW0RAddr &= ~(ADC_STAW0R_THRH_MASK | ADC_STAW0R_THRL_MASK);
    *STAW0RAddr |= ADC_STAW0R_THRH(SelfTestThresholdConfig->AdcSTAW0RHighVal) | ADC_STAW0R_THRL(SelfTestThresholdConfig->AdcSTAW0RLowVal);
#endif /* ADC_STAW0R_AWDE */

#ifdef ADC_STAW1R_AWDE
    /* Configure the self-test watchdog threshold for S1 algorithm */
    *STAW1RAddr &= ~(ADC_STAW1R_THRL_MASK);
    *STAW1RAddr |= ADC_STAW1R_THRL(SelfTestThresholdConfig->AdcSTAW1RLowVal);
#endif /* ADC_STAW1R_AWDE */
#ifdef ADC_STAW1AR_AWDE
    /* Configure the self-test watchdog threshold for S1 algorithm */
    *STAW1ARAddr &= ~(ADC_STAW1AR_THRH_MASK | ADC_STAW1AR_THRL_MASK);
    *STAW1ARAddr |= ADC_STAW1AR_THRH(SelfTestThresholdConfig->AdcSTAW1ARHighVal) | ADC_STAW1AR_THRL(SelfTestThresholdConfig->AdcSTAW1ARLowVal);
    *STAW1BRAddr &= ~(ADC_STAW1BR_THRH_MASK | ADC_STAW1BR_THRL_MASK);
    *STAW1BRAddr |= ADC_STAW1BR_THRH(SelfTestThresholdConfig->AdcSTAW1BRHighVal) | ADC_STAW1BR_THRL(SelfTestThresholdConfig->AdcSTAW1BRLowVal);
#endif /* ADC_STAW1AR_AWDE */

#ifdef ADC_STAW2R_AWDE
    /* Configure the self-test watchdog threshold for S2 algorithm */
    *STAW2RAddr &= ~(ADC_STAW2R_THRL_MASK);
    *STAW2RAddr |= ADC_STAW2R_THRL(SelfTestThresholdConfig->AdcSTAW2RLowVal);
#endif /* ADC_STAW2R_AWDE */

#ifdef ADC_STAW4R_AWDE
    /* Configure the self-test watchdog threshold for C algorithm */
    *STAW4RAddr &= ~(ADC_STAW4R_THRH_MASK | ADC_STAW4R_THRL_MASK);
    *STAW4RAddr |= ADC_STAW4R_THRH(SelfTestThresholdConfig->AdcSTAW4RHighVal) | ADC_STAW4R_THRL(SelfTestThresholdConfig->AdcSTAW4RLowVal);
    *STAW5RAddr &= ~(ADC_STAW5R_THRH_MASK | ADC_STAW5R_THRL_MASK);
    *STAW5RAddr |= ADC_STAW5R_THRH(SelfTestThresholdConfig->AdcSTAW5RHighVal) | ADC_STAW5R_THRL(SelfTestThresholdConfig->AdcSTAW5RLowVal);
#endif /* ADC_STAW4R_AWDE */
}

/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_EnableSelftestThreshold
 * Description   : Enable self-test threshold
 *
 *END*************************************************************************/
static inline void Adc_Sar_EnableSelftestThreshold(const uint32 Instance)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    SAR_ADC_AE_Type * AdcAEBasePtr = NULL_PTR;
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
#ifdef ADC_STAW0R_AWDE
    volatile uint32 * STAW0RAddr = NULL_PTR;
#endif /* ADC_STAW0R_AWDE */
#ifdef ADC_STAW1R_AWDE
    volatile uint32 * STAW1RAddr = NULL_PTR;
#endif /* ADC_STAW1R_AWDE */
#ifdef ADC_STAW1AR_AWDE
    volatile uint32 * STAW1ARAddr = NULL_PTR;
#endif /* ADC_STAW1AR_AWDE */
#ifdef ADC_STAW2R_AWDE
    volatile uint32 * STAW2RAddr = NULL_PTR;
#endif /* ADC_STAW2R_AWDE */
#ifdef ADC_STAW4R_AWDE
    volatile uint32 * STAW4RAddr = NULL_PTR;
#endif /* ADC_STAW4R_AWDE */

#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    if (Instance >= ADC_INSTANCE_COUNT)
    {
        AdcAEBasePtr = Adc_Sar_AE_Ip_apxAdcBase[Instance - ADC_INSTANCE_COUNT];
#ifdef ADC_STAW0R_AWDE
        STAW0RAddr = (volatile uint32 *)&(AdcAEBasePtr->STAW0R);
#endif /* ADC_STAW0R_AWDE */
#ifdef ADC_STAW1R_AWDE
        STAW1RAddr = (volatile uint32 *)&(AdcAEBasePtr->STAW1R);
#endif /* ADC_STAW1R_AWDE */
#ifdef ADC_STAW1AR_AWDE
        STAW1ARAddr = (volatile uint32 *)&(AdcAEBasePtr->STAW1AR);
#endif /* ADC_STAW1AR_AWDE */
#ifdef ADC_STAW2R_AWDE
        STAW2RAddr = (volatile uint32 *)&(AdcAEBasePtr->STAW2R);
#endif /* ADC_STAW2R_AWDE */
#ifdef ADC_STAW4R_AWDE
        STAW4RAddr = (volatile uint32 *)&(AdcAEBasePtr->STAW4R);
#endif /* ADC_STAW4R_AWDE */
    }
    else
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
#ifdef ADC_STAW0R_AWDE
        STAW0RAddr = (volatile uint32 *)&(AdcBasePtr->STAW0R);
#endif /* ADC_STAW0R_AWDE */
#ifdef ADC_STAW1R_AWDE
        STAW1RAddr = (volatile uint32 *)&(AdcBasePtr->STAW1R);
#endif /* ADC_STAW1R_AWDE */
#ifdef ADC_STAW1AR_AWDE
        STAW1ARAddr = (volatile uint32 *)&(AdcBasePtr->STAW1AR);
#endif /* ADC_STAW1AR_AWDE */
#ifdef ADC_STAW2R_AWDE
        STAW2RAddr = (volatile uint32 *)&(AdcBasePtr->STAW2R);
#endif /* ADC_STAW2R_AWDE */
#ifdef ADC_STAW4R_AWDE
        STAW4RAddr = (volatile uint32 *)&(AdcBasePtr->STAW4R);
#endif /* ADC_STAW4R_AWDE */
    }

