rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Sar_Ip.c
#ifdef ADC_STAW0R_AWDE
    /* Enable the self-test watchdog threshold for S0 algorithm */
    *STAW0RAddr |= ADC_STAW0R_AWDE(0x1UL);
#endif /* ADC_STAW0R_AWDE */

#ifdef ADC_STAW1R_AWDE
    /* Enable the self-test watchdog threshold for S1 algorithm */
    *STAW1RAddr |= ADC_STAW1R_AWDE(0x1UL);
#endif /* ADC_STAW1R_AWDE */
#ifdef ADC_STAW1AR_AWDE
    /* Enable the self-test watchdog threshold for S1 algorithm */
    *STAW1ARAddr |= ADC_STAW1AR_AWDE(0x1UL);
#endif /* ADC_STAW1AR_AWDE */

#ifdef ADC_STAW2R_AWDE
    /* Enable the self-test watchdog threshold for S2 algorithm */
    *STAW2RAddr |= ADC_STAW2R_AWDE(0x1UL);
#endif /* ADC_STAW2R_AWDE */

#ifdef ADC_STAW4R_AWDE
    /* Enable the self-test watchdog threshold for C algorithm */
    *STAW4RAddr |= ADC_STAW4R_AWDE(0x1UL);
#endif /* ADC_STAW4R_AWDE */
}

/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_DisableSelftestThreshold
 * Description   : Disable self-test threshold
 *
 *END*************************************************************************/
static inline void Adc_Sar_DisableSelftestThreshold(const uint32 Instance)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    SAR_ADC_AE_Type * AdcAEBasePtr = NULL_PTR;
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
#ifdef ADC_STAW0R_AWDE
    volatile uint32 * STAW0RAddr = NULL_PTR;
#endif /* ADC_STAW0R_AWDE */
#ifdef ADC_STAW1R_AWDE
    volatile uint32 * STAW1RAddr = NULL_PTR;
#endif /* ADC_STAW1R_AWDE */
#ifdef ADC_STAW1AR_AWDE
    volatile uint32 * STAW1ARAddr = NULL_PTR;
#endif /* ADC_STAW1AR_AWDE */
#ifdef ADC_STAW2R_AWDE
    volatile uint32 * STAW2RAddr = NULL_PTR;
#endif /* ADC_STAW2R_AWDE */
#ifdef ADC_STAW4R_AWDE
    volatile uint32 * STAW4RAddr = NULL_PTR;
#endif /* ADC_STAW4R_AWDE */

#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    if (Instance >= ADC_INSTANCE_COUNT)
    {
        AdcAEBasePtr = Adc_Sar_AE_Ip_apxAdcBase[Instance - ADC_INSTANCE_COUNT];
#ifdef ADC_STAW0R_AWDE
        STAW0RAddr = (volatile uint32 *)&(AdcAEBasePtr->STAW0R);
#endif /* ADC_STAW0R_AWDE */
#ifdef ADC_STAW1R_AWDE
        STAW1RAddr = (volatile uint32 *)&(AdcAEBasePtr->STAW1R);
#endif /* ADC_STAW1R_AWDE */
#ifdef ADC_STAW1AR_AWDE
        STAW1ARAddr = (volatile uint32 *)&(AdcAEBasePtr->STAW1AR);
#endif /* ADC_STAW1AR_AWDE */
#ifdef ADC_STAW2R_AWDE
        STAW2RAddr = (volatile uint32 *)&(AdcAEBasePtr->STAW2R);
#endif /* ADC_STAW2R_AWDE */
#ifdef ADC_STAW4R_AWDE
        STAW4RAddr = (volatile uint32 *)&(AdcAEBasePtr->STAW4R);
#endif /* ADC_STAW4R_AWDE */
    }
    else
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
#ifdef ADC_STAW0R_AWDE
        STAW0RAddr = (volatile uint32 *)&(AdcBasePtr->STAW0R);
#endif /* ADC_STAW0R_AWDE */
#ifdef ADC_STAW1R_AWDE
        STAW1RAddr = (volatile uint32 *)&(AdcBasePtr->STAW1R);
#endif /* ADC_STAW1R_AWDE */
#ifdef ADC_STAW1AR_AWDE
        STAW1ARAddr = (volatile uint32 *)&(AdcBasePtr->STAW1AR);
#endif /* ADC_STAW1AR_AWDE */
#ifdef ADC_STAW2R_AWDE
        STAW2RAddr = (volatile uint32 *)&(AdcBasePtr->STAW2R);
#endif /* ADC_STAW2R_AWDE */
#ifdef ADC_STAW4R_AWDE
        STAW4RAddr = (volatile uint32 *)&(AdcBasePtr->STAW4R);
#endif /* ADC_STAW4R_AWDE */
    }

#ifdef ADC_STAW0R_AWDE
    /* Disable the self-test watchdog threshold for S0 algorithm */
    *STAW0RAddr &= ~(ADC_STAW0R_AWDE_MASK);
#endif /* ADC_STAW0R_AWDE */
#ifdef ADC_STAW1R_AWDE
    /* Disable the self-test watchdog threshold for S1 algorithm */
    *STAW1RAddr &= ~(ADC_STAW1R_AWDE_MASK);
#endif /* ADC_STAW1R_AWDE */
#ifdef ADC_STAW1AR_AWDE
    /* Enable the self-test watchdog threshold for S1 algorithm */
    *STAW1ARAddr &= ~(ADC_STAW1AR_AWDE_MASK);
#endif /* ADC_STAW1AR_AWDE */
#ifdef ADC_STAW2R_AWDE
    /* Disable the self-test watchdog threshold for S2 algorithm */
    *STAW2RAddr &= ~(ADC_STAW2R_AWDE_MASK);
#endif /* ADC_STAW2R_AWDE */
#ifdef ADC_STAW4R_AWDE
    /* Disable the self-test watchdog threshold for C algorithm */
    *STAW4RAddr &= ~(ADC_STAW4R_AWDE_MASK);
#endif /* ADC_STAW4R_AWDE */
}
#endif /* (STD_ON == ADC_SAR_IP_SELFTEST_ENABLED) */

/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_GetMaskedResult
 * Description   : Returns result masked accordingly with alignment
 *
 *END*************************************************************************/
static inline uint16 Adc_Sar_GetMaskedResult(const uint32 Instance,
                                             const uint32 Cdr)
{
    uint32 CdrMask;
    uint16 Result;
#if (ADC_SAR_IP_SET_RESOLUTION == STD_ON)
    uint8 Resolution;
    uint32 ResolutionMask;
    uint8 ResolutionShift;
#else
    uint8 Resolution = ADC_SAR_IP_MAX_RESOLUTION;
#endif /* (ADC_SAR_IP_SET_RESOLUTION == STD_ON) */

#if (ADC_SAR_IP_SET_RESOLUTION == STD_ON)
    if (FALSE == Adc_Sar_Ip_axAdcSarState[Instance].BypassResolution)
    {
        Resolution = Adc_Sar_GetResolution(Instance);
    }
    else
    {
        Resolution = ADC_SAR_IP_RESULT_RESOLUTION;
    }
#endif /* (ADC_SAR_IP_SET_RESOLUTION == STD_ON) */

    /* If the result is left aligned, adjust register mask accordingly */
    if (Adc_Sar_Ip_axAdcSarState[Instance].DataAlign == ADC_SAR_IP_DATA_ALIGNED_LEFT)
    {
        /* Assumption: the width of the register is less than 16 */
        CdrMask = (uint32)ADC_CDR_CDATA_MASK << (16u - Resolution);
        Result = ((uint16)(Cdr & CdrMask)) >> (16u - Resolution + ADC_CDR_CDATA_SHIFT);
    }
#if (ADC_SAR_IP_SET_RESOLUTION == STD_ON)
    else
    {
        ResolutionMask = (uint32)ADC_CDR_CDATA_MASK << (ADC_SAR_IP_RESULT_RESOLUTION - Resolution);
        ResolutionShift = ADC_SAR_IP_RESULT_RESOLUTION - Resolution + ADC_CDR_CDATA_SHIFT;
        CdrMask = ((uint32)ADC_CDR_CDATA_MASK >> 1u) & ResolutionMask;
        Result = ((uint16)(Cdr & CdrMask)) >> ResolutionShift;
    }
#else
    else
    {
        CdrMask = (uint32)ADC_CDR_CDATA_MASK;
        Result = ((uint16)(Cdr & CdrMask)) >> ADC_CDR_CDATA_SHIFT;
    }
#endif /* (ADC_SAR_IP_SET_RESOLUTION == STD_ON) */
    return Result;
}


/*FUNCTION*********************************************************************
 *
 * Function Name : Adc_Sar_GetMsrFlags
 * Description   : Returns the flag status from MSR register
 *
 *END*************************************************************************/
static inline uint32 Adc_Sar_GetMsrFlags(const uint32 Instance)
{
    uint32 Msr = 0U;
    uint32 Flags = 0U;
    const ADC_Type * AdcBasePtr = NULL_PTR;
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    const SAR_ADC_AE_Type * AdcAEBasePtr = NULL_PTR;
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */

#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    if (Instance >= ADC_INSTANCE_COUNT)
    {
        AdcAEBasePtr = Adc_Sar_AE_Ip_apxAdcBase[Instance - ADC_INSTANCE_COUNT];
        Msr = AdcAEBasePtr->MSR;
    }
    else
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];
        Msr = AdcBasePtr->MSR;
    }

