rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Sar_Ip.c
        Status = Adc_Sar_Ip_Powerup(u32Instance);

    }
    return Status;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : Adc_Sar_CalibrationClkRestore
 * Description   : This function restore ADC clock after calibration.
 *
 *END**************************************************************************/
static inline Adc_Sar_Ip_StatusType Adc_Sar_CalibrationClkRestore(const uint32 u32Instance, volatile uint32 * MCRAddr, uint32 McrSavedValue)
{
    uint32 Mcr;
    Adc_Sar_Ip_StatusType Status = ADC_SAR_IP_STATUS_SUCCESS;

#if ADC_SAR_IP_HAS_ADCLKSEL
        /* Restore state of ADCLKSEL  */
    uint32 AdcClkSel = McrSavedValue & ADC_MCR_ADCLKSEL_MASK;
#endif /* ADC_SAR_IP_HAS_ADCLKSEL */

    /* Restore state of ADCKO */
    uint32 AdcAutoClkOff = McrSavedValue & ADC_MSR_ACKO_MASK;

    /* Restore the state of ADCLKSEL */
    Status = Adc_Sar_Ip_Powerdown(u32Instance);
    
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_12();
    Mcr = *MCRAddr;
#if ADC_SAR_IP_HAS_ADCLKSEL
    Mcr &= ~(ADC_MCR_ADCLKSEL_MASK);
    Mcr |= AdcClkSel;
#endif /* ADC_SAR_IP_HAS_ADCLKSEL */
    Mcr |= AdcAutoClkOff;
    *MCRAddr = Mcr;
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_12();

    if (ADC_SAR_IP_STATUS_SUCCESS == Status)
    {
        Status = Adc_Sar_Ip_Powerup(u32Instance);
    }

#if (ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)
    Adc_Sar_Ip_axAdcSarState[u32Instance].CalibrationOnGoing = FALSE;
#endif /*(ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON) */
    return Status;
}
#endif /* FEATURE_ADC_HAS_CALIBRATION */
/*==================================================================================================
*                                       GLOBAL FUNCTIONS
==================================================================================================*/
/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_Init
* Description   : This function initializes the ADC_SAR module by configuring all
* available features.
*
* @implements      Adc_Sar_Ip_Init_Activity
* END**************************************************************************/
Adc_Sar_Ip_StatusType Adc_Sar_Ip_Init(const uint32 u32Instance,
                                      const Adc_Sar_Ip_ConfigType * const pConfig)
{
    Adc_Sar_Ip_StatusType Status = ADC_SAR_IP_STATUS_SUCCESS;
#if (STD_ON == ADC_SAR_IP_WDG_ENABLED)
    uint8 Index = 0u;
#endif /* (STD_ON == ADC_SAR_IP_WDG_ENABLED) */
    volatile uint32 * MCRAddr = NULL_PTR;
    volatile uint32 * PDEDRAddr = NULL_PTR;
    volatile uint32 * DMAEAddr = NULL_PTR;
#if FEATURE_ADC_SAR_DECODE_DELAY
    volatile uint32 * DSDRAddr = NULL_PTR;
#endif /* FEATURE_ADC_SAR_DECODE_DELAY */
#if FEATURE_ADC_HAS_PRESAMPLING
    volatile uint32 * PSCRAddr = NULL_PTR;
#endif /* FEATURE_ADC_HAS_PRESAMPLING */

    ADC_Type * AdcBasePtr = NULL_PTR;
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    SAR_ADC_AE_Type * AdcAEBasePtr = NULL_PTR;
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(u32Instance < ADC_SAR_IP_INSTANCE_COUNT);
    DevAssert(pConfig != NULL_PTR);
#if ADC_SAR_IP_HAS_CTU
#if (ADC_SAR_IP_HAS_CTU_TRIGGER_MODE == 0u)
    /* test that the feature is enabled only on platforms that have it */
    DevAssert(pConfig->CtuMode != ADC_SAR_IP_CTU_MODE_TRIGGER);
#endif /* ADC_SAR_IP_HAS_CTU */
#endif /* (ADC_SAR_IP_HAS_CTU_TRIGGER_MODE == 0u) */
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    if (u32Instance >= ADC_INSTANCE_COUNT)
    {
        AdcAEBasePtr = Adc_Sar_AE_Ip_apxAdcBase[u32Instance - ADC_INSTANCE_COUNT];
        MCRAddr = (volatile uint32 *)&(AdcAEBasePtr->MCR);
        PDEDRAddr = (volatile uint32 *)&(AdcAEBasePtr->PDEDR);
        DMAEAddr = (volatile uint32 *)&(AdcAEBasePtr->DMAE);
#if FEATURE_ADC_SAR_DECODE_DELAY
        DSDRAddr = (volatile uint32 *)&(AdcAEBasePtr->DSDR);
#endif /* FEATURE_ADC_SAR_DECODE_DELAY */
#if FEATURE_ADC_HAS_PRESAMPLING
        PSCRAddr = (volatile uint32 *)&(AdcAEBasePtr->PSCR);
#endif /* FEATURE_ADC_HAS_PRESAMPLING */
    }
    else
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
        MCRAddr = (volatile uint32 *)&(AdcBasePtr->MCR);
        PDEDRAddr = (volatile uint32 *)&(AdcBasePtr->PDEDR);
        DMAEAddr = (volatile uint32 *)&(AdcBasePtr->DMAE);
#if FEATURE_ADC_SAR_DECODE_DELAY
        DSDRAddr = (volatile uint32 *)&(AdcBasePtr->DSDR);
#endif /* FEATURE_ADC_SAR_DECODE_DELAY */
#if FEATURE_ADC_HAS_PRESAMPLING
        PSCRAddr = (volatile uint32 *)&(AdcBasePtr->PSCR);
#endif /* FEATURE_ADC_HAS_PRESAMPLING */
    }

#if (STD_ON == ADC_SAR_IP_ENABLE_USER_MODE_SUPPORT)
    /* Set the UAA bit in REG_PROT to make the instance accessible in user mode */
    OsIf_Trusted_Call1param(Adc_Sar_Ip_SetUserAccessAllowed, u32Instance);
#endif

    /* Stop any conversions, if any */
    (void)Adc_Sar_Ip_AbortChain(u32Instance, TRUE, FALSE);

    /* Clear CTUEN to allow Powerdown operation to succeed. */
#if defined(ADC_MCR_CTUEN_MASK)
    *MCRAddr &= ~ADC_MCR_CTUEN_MASK;
#endif /* ADC_MCR_CTUEN_MASK */

    /* Clear pending interrupt flags - CPR_RTD_01182 */
    Adc_Sar_Ip_ClearStatusFlags(u32Instance, ADC_SAR_IP_NOTIF_FLAG_ALL);

    Status = Adc_Sar_Ip_Powerdown(u32Instance);
    if (ADC_SAR_IP_STATUS_SUCCESS == Status)
    {
        /* Collects the mask and writes MCR mask */
        *MCRAddr = Adc_Sar_CollectMcrMasks(u32Instance, pConfig, *MCRAddr);

        Adc_Sar_Ip_axAdcSarState[u32Instance].DataAlign = pConfig->DataAlign;

        Status = Adc_Sar_Ip_Powerup(u32Instance);
        if (ADC_SAR_IP_STATUS_SUCCESS == Status)
        {
            if (ADC_SAR_IP_CTU_MODE_TRIGGER == pConfig->CtuMode)
            {
                /* Workaround to enable CTU_MODE because it cannot be written in power-down mode in SAF85 */
                *MCRAddr |= ADC_MCR_CTU_MODE(1U);
            }
#if FEATURE_ADC_HAS_HIGH_SPEED_ENABLE
            /* Enables high speed conversion or calibration */
            Adc_Sar_EnableHighSpeed(AdcBasePtr, pConfig->HighSpeedConvEn);
#endif /* FEATURE_ADC_HAS_HIGH_SPEED_ENABLE */

#if FEATURE_ADC_HAS_CONVERSION_TIMING
            /* Set the sample times for each channnel group */
            Adc_Sar_Ip_SetSampleTimes(u32Instance, pConfig->SampleTimeArr);
#endif /* FEATURE_ADC_HAS_CONVERSION_TIMING */

            *PDEDRAddr = ADC_PDEDR_PDED(pConfig->PowerDownDelay);

#if FEATURE_ADC_HAS_CLOCK_DIVIDER
            /* Configure clock divider */
            Adc_Sar_EnableClkDiv(u32Instance, pConfig->ClkDivEnable);
#endif /* FEATURE_ADC_HAS_CLOCK_DIVIDER */

#ifdef ADC_DSDR_DSD
#if ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE
            if (ADC_SAR_IP_INST_HAS_DSDR(u32Instance))
            {
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE */
#if FEATURE_ADC_SAR_DECODE_DELAY
                *DSDRAddr = ADC_DSDR_DSD(pConfig->DecodeDelay);
#endif /* FEATURE_ADC_SAR_DECODE_DELAY */
#if ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE
            }
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE */
#endif /* ADC_DSDR_DSD */

            /* Configure chain conversions */
            Adc_Sar_SetNormalChain(u32Instance, pConfig->ChanMaskNormal);
            Adc_Sar_SetInjectedChain(u32Instance, pConfig->ChanMaskInjected);

#if (ADC_SAR_IP_SET_RESOLUTION == STD_ON)
            /* Configure resolution */
            Adc_Sar_Ip_SetResolution(u32Instance, pConfig->AdcResolution);
#endif /* (ADC_SAR_IP_SET_RESOLUTION == STD_ON) */

            /* Configure WDG */
#if (STD_ON == ADC_SAR_IP_WDG_ENABLED)
            if ((pConfig->WdgThresholds != NULL_PTR) && (pConfig->NumWdgThresholds > 0u))
            {
                for (Index = 0U; Index < pConfig->NumWdgThresholds; Index++)
                {
                    Adc_Sar_Ip_SetWdgThreshold(u32Instance, pConfig->WdgThresholds[Index].WdgIndex, &pConfig->WdgThresholds[Index]);
                }
            }
#endif /* (STD_ON == ADC_SAR_IP_WDG_ENABLED) */

