rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Sar_Ip.c
    /* Returns the flag status from MSR register */
    Flags |= Adc_Sar_GetMsrFlags(u32Instance);
    /* Returns the flag status from ISR register */
    Flags |= Adc_Sar_GetIsrFlags(u32Instance);

    return Flags;
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_ClearStatusFlags
* Description   : This function clears the status flags that are set to '1' in
*  the mask.
*
* @implements      Adc_Sar_Ip_ClearStatusFlags_Activity
* END**************************************************************************/
void Adc_Sar_Ip_ClearStatusFlags(const uint32 u32Instance,
                                 const uint32 u32Mask)
{
    uint32 IsrFlags = 0U;
    volatile uint32 * ISRAddr = NULL_PTR;

    ADC_Type * AdcBasePtr = NULL_PTR;
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    SAR_ADC_AE_Type * AdcAEBasePtr = NULL_PTR;
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(u32Instance < ADC_SAR_IP_INSTANCE_COUNT);
    DevAssert((u32Mask & (~ADC_SAR_IP_NOTIF_FLAG_ALL)) == 0UL);
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    if (u32Instance >= ADC_INSTANCE_COUNT)
    {
        AdcAEBasePtr = Adc_Sar_AE_Ip_apxAdcBase[u32Instance - ADC_INSTANCE_COUNT];
        ISRAddr = (volatile uint32 *)&(AdcAEBasePtr->ISR);
    }
    else
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
        ISRAddr = (volatile uint32 *)&(AdcBasePtr->ISR);
    }

    IsrFlags |= ((u32Mask & ADC_SAR_IP_NOTIF_FLAG_NORMAL_EOC) != 0U) ? ADC_ISR_EOC(1U) : 0U;
    IsrFlags |= ((u32Mask & ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN) != 0U) ? ADC_ISR_ECH(1U) : 0U;
    IsrFlags |= ((u32Mask & ADC_SAR_IP_NOTIF_FLAG_INJECTED_EOC) != 0U) ? ADC_ISR_JEOC(1U) : 0U;
    IsrFlags |= ((u32Mask & ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN) != 0U) ? ADC_ISR_JECH(1U) : 0U;
#if ADC_SAR_IP_HAS_CTU
#if ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE
    if (ADC_SAR_IP_INST_HAS_CTU(u32Instance))
    {
#endif /*ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE*/
        IsrFlags |= ((u32Mask & ADC_SAR_IP_NOTIF_FLAG_CTU_EOC) != 0U) ? ADC_ISR_EOCTU(1U) : 0U;
#if ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE
    }
#endif /*ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE*/
#endif /* ADC_SAR_IP_HAS_CTU */

    /* Write-1-to-clear bits in ISR register */
    *ISRAddr = IsrFlags;
#ifdef FEATURE_CPU_HAS_WRITE_BUFFER
        (void) *ISRAddr;
#endif /* FEATURE_CPU_HAS_WRITE_BUFFER */
}

#if (STD_ON == ADC_SAR_IP_SELFTEST_ENABLED)
/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_SelfTest
* Description   : This function executes a self test on the ADC instance.
*
* @implements      Adc_Sar_Ip_SelfTest_Activity
* END**************************************************************************/
Adc_Sar_Ip_StatusType Adc_Sar_Ip_SelfTest(const uint32 u32Instance)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    SAR_ADC_AE_Type * AdcAEBasePtr = NULL_PTR;
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    Adc_Sar_Ip_StatusType Status = ADC_SAR_IP_STATUS_SUCCESS;
#if ADC_SAR_IP_HAS_SELFTEST_STCR1
    uint32 Reg;
#endif /* ADC_SAR_IP_HAS_SELFTEST_STCR1 */
    uint32 MsrStatus;
    uint32 TimeoutTicks = OsIf_MicrosToTicks(ADC_SAR_IP_TIMEOUT_VAL, ADC_SAR_IP_TIMEOUT_TYPE);
    uint32 CurrentTicks = OsIf_GetCounter(ADC_SAR_IP_TIMEOUT_TYPE);
    uint32 ElapsedTicks = 0U;
#if (ADC_SAR_IP_SELFTEST_FULL_CLK && ADC_SAR_IP_HAS_ADCLKSEL)
    uint32 AdcClkSel = 0u;
#endif /* (ADC_SAR_IP_SELFTEST_FULL_CLK && ADC_SAR_IP_HAS_ADCLKSEL) */
    volatile uint32 * MCRAddr = NULL_PTR;
    volatile const uint32 * MSRAddr = NULL_PTR;
#if !ADC_SAR_IP_HAS_SELFTEST_USE_CH32
    volatile uint32 * NCMR0Addr = NULL_PTR;
#else
    volatile uint32 * NCMR1Addr = NULL_PTR;
#endif /* ADC_SAR_IP_HAS_SELFTEST_USE_CH32 */
#if ADC_SAR_IP_HAS_SELFTEST_STCR1
    volatile uint32 * STCR1Addr = NULL_PTR;
#endif /* ADC_SAR_IP_HAS_SELFTEST_STCR1 */
    volatile uint32 * STCR2Addr = NULL_PTR;
#if ADC_SAR_IP_HAS_SELFTEST_STCR3
    volatile uint32 * STCR3Addr = NULL_PTR;
#endif /* ADC_SAR_IP_HAS_SELFTEST_STCR3 */
#ifdef ADC_GPADC_ANA_TEST0_VDAC
    uint32 BackupVdacAnaTest0;
#endif
#ifdef ADC_GPADC_ANA_CONF_VIN_SE_REF
    uint32 BackupVinSeRefAnaConf;
#endif

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(u32Instance < ADC_SAR_IP_INSTANCE_COUNT);
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */
#if (ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)
    /* calibration must not be interrupted */
    if(FALSE == Adc_Sar_Ip_axAdcSarState[u32Instance].CalibrationOnGoing)
    {
#endif /*(ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON) */
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
        if (u32Instance >= ADC_INSTANCE_COUNT)
        {
            AdcAEBasePtr = Adc_Sar_AE_Ip_apxAdcBase[u32Instance - ADC_INSTANCE_COUNT];
            MCRAddr = (volatile uint32 *)&(AdcAEBasePtr->MCR);
            MSRAddr = (volatile const uint32 *)&(AdcAEBasePtr->MSR);
#if !ADC_SAR_IP_HAS_SELFTEST_USE_CH32
            NCMR0Addr = &(NCMR(AdcAEBasePtr, 0u));
#else
            NCMR1Addr = &(NCMR(AdcAEBasePtr, 1u));
#endif /* ADC_SAR_IP_HAS_SELFTEST_USE_CH32 */
#if ADC_SAR_IP_HAS_SELFTEST_STCR1
            STCR1Addr = (volatile uint32 *)&(AdcAEBasePtr->STCR1);
#endif /* ADC_SAR_IP_HAS_SELFTEST_STCR1 */
            STCR2Addr = (volatile uint32 *)&(AdcAEBasePtr->STCR2);
#if ADC_SAR_IP_HAS_SELFTEST_STCR3
            STCR3Addr = (volatile uint32 *)&(AdcAEBasePtr->STCR3);
#endif /* ADC_SAR_IP_HAS_SELFTEST_STCR3 */
        }
        else
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
        {
            AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
            MCRAddr = (volatile uint32 *)&(AdcBasePtr->MCR);
            MSRAddr = (volatile const uint32 *)&(AdcBasePtr->MSR);
#if !ADC_SAR_IP_HAS_SELFTEST_USE_CH32
            NCMR0Addr = &(NCMR(AdcBasePtr, 0u));
#else
            NCMR1Addr = &(NCMR(AdcBasePtr, 1u));
#endif /* ADC_SAR_IP_HAS_SELFTEST_USE_CH32 */
#if ADC_SAR_IP_HAS_SELFTEST_STCR1
            STCR1Addr = (volatile uint32 *)&(AdcBasePtr->STCR1);
#endif /* ADC_SAR_IP_HAS_SELFTEST_STCR1 */
            STCR2Addr = (volatile uint32 *)&(AdcBasePtr->STCR2);
#if ADC_SAR_IP_HAS_SELFTEST_STCR3
            STCR3Addr = (volatile uint32 *)&(AdcBasePtr->STCR3);
#endif /* ADC_SAR_IP_HAS_SELFTEST_STCR3 */
        }

#if ADC_SAR_IP_SELFTEST_FULL_CLK
        /* Enter into power-down Mode */
        Status = Adc_Sar_Ip_Powerdown(u32Instance);
        if (ADC_SAR_IP_STATUS_SUCCESS == Status)
        {
#if ADC_SAR_IP_HAS_ADCLKSEL
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_11();
            /* Save the current state of ADCLKSEL in order to restore it */
            AdcClkSel = ((*MCRAddr) & ADC_MCR_ADCLKSEL_MASK);
            /* ADC self-test should be run with MCR[ADCLKSE] bit set to 1 */
            *MCRAddr &= ~(ADC_MCR_ADCLKSEL_MASK);
            *MCRAddr |= ADC_MCR_ADCLKSEL(1U);
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_11();
#endif /* ADC_SAR_IP_HAS_ADCLKSEL */

            /* Exit into power-down Mode */
            Status = Adc_Sar_Ip_Powerup(u32Instance);
            if (ADC_SAR_IP_STATUS_SUCCESS == Status)
            {
#endif /* ADC_SAR_IP_SELFTEST_FULL_CLK */
                SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_25();
#if !ADC_SAR_IP_HAS_SELFTEST_USE_CH32
                /* 1. Program NCMR0 to select channels to be converted for normal conversion.*/
                *NCMR0Addr |= ADC_NCMR_CH0(0x1UL);
#else
                /* Workaround for SAF8544 since self-test result register is written twice with the last channel of chain and self-test channel 32
                Enabling channel 32 at last of chain to have register field having only result of selftest channel 32 */
                *NCMR1Addr |= ADC_NCMR1_CH32(0x1UL);
#endif /* ADC_SAR_IP_HAS_SELFTEST_USE_CH32 */
                SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_25();

