rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Sar_Ip.c
                SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_11();
                /* Self-test will only run with CPU mode so clear CTU enable */
#if defined(ADC_MCR_CTUEN_MASK)
                *MCRAddr &= ~(ADC_MCR_CTUEN_MASK);
#endif /* ADC_MCR_CTUEN_MASK */

                /* 2. Program MCR[MODE] = 1 to select Scan mode. ADC_ONE_SHOT_MODE_U32 ADCDIG_CONTINUOUS_MODE_U32*/
                *MCRAddr |= ADC_MCR_MODE(0x1UL);
                SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_11();
#if ADC_SAR_IP_HAS_SELFTEST_STCR1
                /* 3. Program sampling duration values in STCR1[INPSAMPx].*/
                Reg = 0u;
                Reg |= ADC_STCR1_INPSAMP_S(0x10UL) | ADC_STCR1_INPSAMP_C(0x10UL);
                *STCR1Addr = Reg;
#endif /* ADC_SAR_IP_HAS_SELFTEST_STCR1 */

                SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_35();
#if ADC_SAR_IP_HAS_SELFTEST_STCR3
                /* 4. Select the self-testing algorithm in STCR3[ALG]. */
                *STCR3Addr |= ADC_STCR3_ALG(0x3UL);
#endif /* ADC_SAR_IP_HAS_SELFTEST_STCR3 */
                SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_35();

                Adc_Sar_EnableSelftestThreshold(u32Instance);
#ifdef ADC_GPADC_ANA_TEST0_VDAC
                /* Save the current state of GPADC_ANA_TEST0[ADAC] in order to restore it */
                BackupVdacAnaTest0 = AdcBasePtr->GPADC_ANA_TEST0;
                AdcBasePtr->GPADC_ANA_TEST0 &= ~(ADC_GPADC_ANA_TEST0_VDAC_MASK);
                AdcBasePtr->GPADC_ANA_TEST0 |= ADC_GPADC_ANA_TEST0_VDAC(8U);
#endif /* ADC_GPADC_ANA_TEST0_VDAC */
#ifdef ADC_GPADC_ANA_CONF_VIN_SE_REF
                /* Save the current state of GPADC_ANA_CONF[VIN_SE_REF] in order to restore it */
                BackupVinSeRefAnaConf = AdcBasePtr->GPADC_ANA_CONF;
#endif
#ifdef ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF
                if (ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF_1V6 == ((REG_ACCESS_BY_ADDR(ADC_GPADC_CALCFG0_ADDR) & ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF_MASK) >> ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF_SHIFT))
                {
#ifdef ADC_GPADC_ANA_CONF_VIN_SE_REF
                    /* GPADC_ANA_CONF[VIN_SE_REF] = 1 (enable self-test channel div2 mode) to be aligned with CALCFG0[SET_VREF_OUT_BUF] = 4 (1.6v) (only shown in DDTS) */
                    AdcBasePtr->GPADC_ANA_CONF |= ADC_GPADC_ANA_CONF_VIN_SE_REF(1U);
#endif /* ADC_GPADC_ANA_CONF_VIN_SE_REF */
                }
                else if (ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF_0V8 == ((REG_ACCESS_BY_ADDR(ADC_GPADC_CALCFG0_ADDR) & ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF_MASK) >> ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF_SHIFT))
                {
#ifdef ADC_GPADC_ANA_CONF_VIN_SE_REF
                    /* GPADC_ANA_CONF[VIN_SE_REF] = 0 (disable self-test channel div2 mode) to be aligned with CALCFG0[SET_VREF_OUT_BUF] = 2 (0.8v) (only shown in DDTS) */
                    AdcBasePtr->GPADC_ANA_CONF |= ADC_GPADC_ANA_CONF_VIN_SE_REF(0U);
#endif /* ADC_GPADC_ANA_CONF_VIN_SE_REF */
                }
                else
                {
                    /* Overwrite to 4 (1.6v vref) */
                    REG_ACCESS_BY_ADDR(ADC_GPADC_CALCFG0_ADDR) &= ~(ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF_MASK);
                    REG_ACCESS_BY_ADDR(ADC_GPADC_CALCFG0_ADDR) |= ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF(ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF_1V6);
#ifdef ADC_GPADC_ANA_CONF_VIN_SE_REF
                    /* GPADC_ANA_CONF[VIN_SE_REF] = 1 (enable self-test channel div2 mode) to be aligned with CALCFG0[SET_VREF_OUT_BUF] = 4 (1.6v) (only shown in DDTS) */
                    AdcBasePtr->GPADC_ANA_CONF |= ADC_GPADC_ANA_CONF_VIN_SE_REF(1U);
#endif /* ADC_GPADC_ANA_CONF_VIN_SE_REF */
                    /* Wait after changing SET_VREF_OUT_BUF to avoid unstable result */
                    TimeoutTicks = OsIf_MicrosToTicks(ADC_SAR_IP_BANDGAP_TIMEOUT_VAL, ADC_SAR_IP_TIMEOUT_TYPE);
                    CurrentTicks = OsIf_GetCounter(ADC_SAR_IP_TIMEOUT_TYPE);
                    ElapsedTicks = 0u;
                    while (ElapsedTicks < TimeoutTicks)
                    {
                        ElapsedTicks += OsIf_GetElapsed(&CurrentTicks, ADC_SAR_IP_TIMEOUT_TYPE);
                    }
                }
#endif /* ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF */

                SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_35();
                /* 5. Enable the self-testing channel by setting STCR2[EN]. */
                *STCR2Addr |= ADC_STCR2_EN(0x1UL);
                SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_35();

                /* 6. Start the normal conversion by setting MCR[NSTART]. */
                SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_11();
                *MCRAddr |= ADC_MCR_NSTART(0x1UL);
                SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_11();

                /*  Check that all algorithms have executed at least once. */
                Status = Adc_Sar_CheckSelfTestProgress(u32Instance);

                /* Stop the conversion */
                SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_11();
                *MCRAddr &= ~(ADC_MCR_NSTART(0x1UL));
                SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_11();

                if (ADC_SAR_IP_STATUS_SUCCESS == Status)
                {
                    /* Read ADC status */
                    MsrStatus = ((*MSRAddr) & ADC_MSR_ADCSTATUS_MASK) >> ADC_MSR_ADCSTATUS_SHIFT;
                    /* Wait for ADC changes to the expected Idle mode, The bitfield MSR[ADCSTATUS] should be checked to Idle state when MCR[NSTART] is written to 0 */
                    TimeoutTicks = OsIf_MicrosToTicks(ADC_SAR_IP_TIMEOUT_VAL, ADC_SAR_IP_TIMEOUT_TYPE);
                    ElapsedTicks = 0U;
                    while ((MsrStatus != ADC_MSR_ADCSTATUS(ADC_SAR_IP_MSR_ADCSTATUS_IDLE)) && (ElapsedTicks < TimeoutTicks))
                    {
                        MsrStatus = ((*MSRAddr) & ADC_MSR_ADCSTATUS_MASK) >> ADC_MSR_ADCSTATUS_SHIFT;
                        ElapsedTicks += OsIf_GetElapsed(&CurrentTicks, ADC_SAR_IP_TIMEOUT_TYPE);
                    }
                }

                Adc_Sar_DisableSelftestThreshold(u32Instance);

#ifdef ADC_GPADC_ANA_TEST0_VDAC
                /* Restore the state of GPADC_ANA_TEST0[VDAC] */
                AdcBasePtr->GPADC_ANA_TEST0 = BackupVdacAnaTest0;
#endif /* ADC_GPADC_ANA_TEST0_VDAC */
#ifdef ADC_GPADC_ANA_CONF_VIN_SE_REF
                /* Restore the state of GPADC_ANA_CONF[VIN_SE_REF] */
                AdcBasePtr->GPADC_ANA_CONF = BackupVinSeRefAnaConf;
#endif /* ADC_GPADC_ANA_CONF_VIN_SE_REF */

                /* Disable Self-test */
                SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_35();
                *STCR2Addr &= ~(ADC_STCR2_EN(0x1UL));
                SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_35();

#if ADC_SAR_IP_SELFTEST_FULL_CLK
            }
            if (ADC_SAR_IP_STATUS_SUCCESS == Status)
            {
                /* Enter into power-down Mode */
                Status = Adc_Sar_Ip_Powerdown(u32Instance);
#if ADC_SAR_IP_HAS_ADCLKSEL
                SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_11();
                /* Restore the state of ADCLKSEL */
                *MCRAddr &= ~(ADC_MCR_ADCLKSEL_MASK);
                *MCRAddr |= AdcClkSel;
                SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_11();
#endif /* ADC_SAR_IP_HAS_ADCLKSEL */

                if (ADC_SAR_IP_STATUS_SUCCESS == Status)
                {
                    /* Exit into power-down Mode */
                    Status = Adc_Sar_Ip_Powerup(u32Instance);
                    if (ADC_SAR_IP_STATUS_SUCCESS == Status)
#endif /* ADC_SAR_IP_SELFTEST_FULL_CLK */
                    {
                        Status = Adc_Sar_CheckTimeoutStatus(ElapsedTicks, TimeoutTicks);
                    }
#if ADC_SAR_IP_SELFTEST_FULL_CLK
                }
            }
        }
#endif /* ADC_SAR_IP_SELFTEST_FULL_CLK */
#if (ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)
    }
    else
    {
        Status = ADC_SAR_IP_STATUS_CAL_ONGOING;
    }
#endif /*(ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON) */
    return Status;
}
#endif /* (STD_ON == ADC_SAR_IP_SELFTEST_ENABLED) */

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_GetConvDataToArray
* Description   : This function reads the conversion result values for a conversion chain
*  (ADC_SAR_IP_CONV_CHAIN_NORMAL, ADC_SAR_IP_CONV_CHAIN_INJECTED or ADC_SAR_IP_CONV_CHAIN_CTU).
*
* @implements      Adc_Sar_Ip_GetConvDataToArray_Activity
* END**************************************************************************/
uint32 Adc_Sar_Ip_GetConvDataToArray(const uint32 u32Instance,
                                     const Adc_Sar_Ip_ConvChainType pChainType,
                                     const uint32 u32Length,
                                     uint16 * const pResults)
{
#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(u32Instance < ADC_SAR_IP_INSTANCE_COUNT);
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */
    return Adc_Sar_GetConvResults(u32Instance, pChainType, pResults, NULL_PTR, u32Length);
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_GetConvResultsToArray
* Description   : This function gets the conversion results for the selected
*  Conversion Chain. It follows the same algorithm as Adc_Sar_Ip_GetConvDataToArray,
*  but will copy some extra information to the output.
*
* @implements      Adc_Sar_Ip_GetConvResultsToArray_Activity
* END**************************************************************************/
uint32 Adc_Sar_Ip_GetConvResultsToArray(const uint32 u32Instance,
                                        const Adc_Sar_Ip_ConvChainType pChainType,
                                        const uint32 u32Length,
                                        Adc_Sar_Ip_ChanResultType* const pResults)
{
#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(u32Instance < ADC_SAR_IP_INSTANCE_COUNT);
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */
    return Adc_Sar_GetConvResults(u32Instance, pChainType, NULL_PTR, pResults, u32Length);
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_GetConvData
* Description   : This function returns the result of the conversion for
* a single channel
*
* @implements      Adc_Sar_Ip_GetConvData_Activity
* END**************************************************************************/
uint16 Adc_Sar_Ip_GetConvData(const uint32 u32Instance,
                              const uint32 u32ChnIdx)
{
    uint16 Result = 0U;
    uint32 VectAdr;
    uint32 VectBit;
    uint32 Cdr;
    ADC_Type * AdcBasePtr = NULL_PTR;
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    SAR_ADC_AE_Type * AdcAEBasePtr = NULL_PTR;
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(u32Instance < ADC_SAR_IP_INSTANCE_COUNT);
    DevAssert(u32ChnIdx < ADC_SAR_IP_CDR_COUNT);
#if ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL
    DevAssert(ADC_SAR_IP_INST_HAS_CHANn(u32Instance, u32ChnIdx));
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL */
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    VectAdr = ADC_SAR_IP_CHAN_2_VECT(u32ChnIdx);
    VectBit = ADC_SAR_IP_CHAN_2_BIT(u32ChnIdx);
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    if (u32Instance >= ADC_INSTANCE_COUNT)
    {
        AdcAEBasePtr = Adc_Sar_AE_Ip_apxAdcBase[u32Instance - ADC_INSTANCE_COUNT];
        Cdr = CDR_AE(AdcAEBasePtr, u32ChnIdx);
        /* check if the conversion data is valid */
        if (((Cdr & ADC_CDR_VALID_MASK) != 0U))
        {
            /* the data is correct, store the result in and clear the flag */
            Result = Adc_Sar_GetMaskedResult(u32Instance, Cdr);
            CEOCFR(AdcAEBasePtr, VectAdr) = ((uint32)1UL << VectBit); /* w1c bit */
        }
    }
    else
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
        Cdr = CDR(AdcBasePtr, u32ChnIdx);
        /* check if the conversion data is valid */
        if (((Cdr & ADC_CDR_VALID_MASK) != 0U))
        {
#if FEATURE_ADC_SAF8544_CHANNEL_WORKAROUND
            if (!(((ADC_CDR_RESULT((uint32)ADC_SAR_IP_CONV_CHAIN_INJECTED) == (Cdr & (ADC_CDR_RESULT_MASK))) \
               || (ADC_CDR_RESULT((uint32)ADC_SAR_IP_CONV_CHAIN_CTU) == (Cdr & (ADC_CDR_RESULT_MASK)))) \
               && (0u == u32ChnIdx) \
                 ) \
               )
#endif
            {
                /* the data is correct, store the result in and clear the flag */
                Result = Adc_Sar_GetMaskedResult(u32Instance, Cdr);
                CEOCFR(AdcBasePtr, VectAdr) = ((uint32)1UL << VectBit); /* w1c bit */
            }
        }
    }

    return Result;
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_GetConvResult
* Description   : This function returns the result and the status of
* the conversion for a single channel
*
* @implements      Adc_Sar_Ip_GetConvResult_Activity
* END**************************************************************************/
void Adc_Sar_Ip_GetConvResult(const uint32 u32Instance,
                              const uint32 u32ChnIdx,
                              const Adc_Sar_Ip_ConvChainType pChainType,
                              Adc_Sar_Ip_ChanResultType * const pResult)
{
    uint32 VectAdr;
    uint32 VectBit;
    uint32 Cdr;
    volatile uint32 * CEOCFRAddr = NULL_PTR;
    ADC_Type * AdcBasePtr = NULL_PTR;
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    SAR_ADC_AE_Type * AdcAEBasePtr = NULL_PTR;
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(u32Instance < ADC_SAR_IP_INSTANCE_COUNT);
    DevAssert(u32ChnIdx < ADC_SAR_IP_CDR_COUNT);
    DevAssert(pResult != NULL_PTR);
#if ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL
    DevAssert(ADC_SAR_IP_INST_HAS_CHANn(u32Instance, u32ChnIdx));
#endif /* ADC_SAR_IP_BAD_ACCESS_PROT_CHANNEL */
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    VectAdr = ADC_SAR_IP_CHAN_2_VECT(u32ChnIdx);
    VectBit = ADC_SAR_IP_CHAN_2_BIT(u32ChnIdx);

    pResult->ConvData = 0u;
    pResult->AdcChnIdx = (uint8)u32ChnIdx;
    pResult->ValidFlag = FALSE;
    pResult->OverWrittenFlag = FALSE;

#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    if (u32Instance >= ADC_INSTANCE_COUNT)
    {
        AdcAEBasePtr = Adc_Sar_AE_Ip_apxAdcBase[u32Instance - ADC_INSTANCE_COUNT];
        Cdr = CDR_AE(AdcAEBasePtr, u32ChnIdx);
        CEOCFRAddr = &(CEOCFR(AdcAEBasePtr, VectAdr));
    }
    else
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
        Cdr = CDR(AdcBasePtr, u32ChnIdx);
        CEOCFRAddr = &(CEOCFR(AdcBasePtr, VectAdr));
    }

    /* check if the result type matches the one request by pChainType */
    if (ADC_CDR_RESULT((uint32)pChainType) == (Cdr & ADC_CDR_RESULT_MASK))
    {
#if FEATURE_ADC_SAF8544_CHANNEL_WORKAROUND
        if (!((0U == u32ChnIdx) && ((ADC_SAR_IP_CONV_CHAIN_INJECTED == pChainType) || (ADC_SAR_IP_CONV_CHAIN_CTU == pChainType))))
#endif /* FEATURE_ADC_SAF8544_CHANNEL_WORKAROUND */
        {
            pResult->ValidFlag = ((Cdr & ADC_CDR_VALID_MASK) != 0U) ? TRUE : FALSE;
            pResult->OverWrittenFlag = (1U == ((Cdr & ADC_CDR_OVERW_MASK) >> ADC_CDR_OVERW_SHIFT));
            pResult->ConvData = Adc_Sar_GetMaskedResult(u32Instance, Cdr);
        }
    }

    *CEOCFRAddr = ((uint32)1UL << VectBit); /* w1c bit */
}

