rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Sar_Ip.c
                }
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
            }
            else
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
#endif /* (!ADC_SAR_IP_CALIBRATION_USES_MCR || FEATURE_ADC_HAS_APPLICATION_EXTENSION) */
            {
#if ADC_SAR_IP_CALIBRATION_USES_MCR
#if (ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)
                if(Adc_Sar_Ip_axAdcSarState[u32Instance].CalibrationOnGoing == FALSE)
                {
                    Adc_Sar_Ip_axAdcSarState[u32Instance].CalibrationOnGoing = TRUE;
#endif /*(ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON) */
                    Status = Adc_Sar_CalibrationClkSelect(u32Instance, MCRAddr, &McrSavedValue);

                    if (ADC_SAR_IP_STATUS_SUCCESS == Status)
                    {
                        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_12();
                        /* Clear the bits and set to calibration values */
                        Mcr = AdcBasePtr->MCR;
                        Mcr &= ~(ADC_MCR_TSAMP_MASK | ADC_MCR_NRSMPL_MASK | ADC_MCR_AVGEN_MASK);
                        Mcr |= ADC_MCR_NRSMPL(0x03u) | ADC_MCR_AVGEN(1U);
                        AdcBasePtr->MCR = Mcr;

                        /* Start calibration */
                        AdcBasePtr->MCR |= ADC_MCR_CALSTART(1U);
                        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_12();
                    }
#if (ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)
                    Status = ADC_SAR_IP_STATUS_CAL_ONGOING;
                }
                else
#endif /*(ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)*/
                {
                    /* Wait for calibration to finish */
                    while (((AdcBasePtr->MSR & ADC_MSR_CALBUSY_MASK) != 0U) && (ElapsedTicks < TimeoutTicks))
                    {
                        ElapsedTicks += OsIf_GetElapsed(&CurrentTicks, ADC_SAR_IP_TIMEOUT_TYPE);
                    }

                    if (ElapsedTicks >= TimeoutTicks)
                    {
                        CalStatus = ADC_SAR_IP_STATUS_TIMEOUT;
                    }
                    else if ((AdcBasePtr->MSR & ADC_MSR_CALFAIL_MASK) != 0U)
                    {
                        /* If the calibration failed, return error */
                        CalStatus = ADC_SAR_IP_STATUS_ERROR;
                    }
                    else
                    {
                        ; /* Empty else branch to avoid MISRA */
                    }
                    Status = Adc_Sar_CalibrationClkRestore(u32Instance, MCRAddr, McrSavedValue);
                }
#endif /* ADC_SAR_IP_CALIBRATION_USES_MCR */
            }
            if (ADC_SAR_IP_STATUS_SUCCESS == Status)
            {
                Status = CalStatus;
            }
    return Status;
}
#endif /* FEATURE_ADC_HAS_CALIBRATION */

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_Powerup
* Description   : This function enables the ADC module (by clearing the Powerdown
*  bit).
*
* @implements      Adc_Sar_Ip_Powerup_Activity
* END**************************************************************************/
Adc_Sar_Ip_StatusType Adc_Sar_Ip_Powerup(const uint32 u32Instance)
{
    Adc_Sar_Ip_StatusType ReturnStatus = ADC_SAR_IP_STATUS_SUCCESS;

    const ADC_Type * AdcBasePtr = NULL_PTR;
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    const SAR_ADC_AE_Type * AdcAEBasePtr = NULL_PTR;
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
#if ADC_SAR_IP_HAS_BANDGAP_STATUS
    uint32 BandGapStatus = 0u;
#else
    uint32 ExpectedStatus = ADC_MSR_ADCSTATUS(ADC_SAR_IP_MSR_ADCSTATUS_IDLE);  /* expected status is IDLE */
    uint32 MsrStatus;
    volatile const uint32 * MSRAddr = NULL_PTR;
#endif /* ADC_SAR_IP_HAS_BANDGAP_STATUS */
    uint32 TimeoutTicks = OsIf_MicrosToTicks(ADC_SAR_IP_TIMEOUT_VAL, ADC_SAR_IP_TIMEOUT_TYPE);
    uint32 CurrentTicks = OsIf_GetCounter(ADC_SAR_IP_TIMEOUT_TYPE);
    uint32 ElapsedTicks = 0u;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(u32Instance < ADC_SAR_IP_INSTANCE_COUNT);
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    if (u32Instance >= ADC_INSTANCE_COUNT)
    {
        AdcAEBasePtr = Adc_Sar_AE_Ip_apxAdcBase[u32Instance - ADC_INSTANCE_COUNT];
#if !ADC_SAR_IP_HAS_BANDGAP_STATUS
        MSRAddr = (volatile const uint32 *)&(AdcAEBasePtr->MSR);
#endif /* !ADC_SAR_IP_HAS_BANDGAP_STATUS */
    }
    else
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
#if !ADC_SAR_IP_HAS_BANDGAP_STATUS
        MSRAddr = (volatile const uint32 *)&(AdcBasePtr->MSR);
#endif /* !ADC_SAR_IP_HAS_BANDGAP_STATUS */
    }

#if ADC_SAR_IP_HAS_BANDGAP_STATUS
    BandGapStatus = AdcBasePtr->GPADC_READOUT & ADC_GPADC_READOUT_BG_OK_MASK;
#else
    MsrStatus = (*MSRAddr) & ADC_MSR_ADCSTATUS_MASK;
#endif /* ADC_SAR_IP_HAS_BANDGAP_STATUS */

    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_13();
    Adc_Sar_Powerup(u32Instance);
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_13();

    /* Wait for the device to power up */
#if ADC_SAR_IP_HAS_BANDGAP_STATUS
    while ((0U == BandGapStatus) && (ElapsedTicks < TimeoutTicks))
    {
        BandGapStatus = AdcBasePtr->GPADC_READOUT & ADC_GPADC_READOUT_BG_OK_MASK;
        ElapsedTicks += OsIf_GetElapsed(&CurrentTicks, ADC_SAR_IP_TIMEOUT_TYPE);
    }
#else
    while ((MsrStatus != ExpectedStatus) && (ElapsedTicks < TimeoutTicks))
    {
        MsrStatus = (*MSRAddr) & ADC_MSR_ADCSTATUS_MASK;
        ElapsedTicks += OsIf_GetElapsed(&CurrentTicks, ADC_SAR_IP_TIMEOUT_TYPE);
    }
#endif /* ADC_SAR_IP_HAS_BANDGAP_STATUS */

    if (ElapsedTicks >= TimeoutTicks)
    {
        ReturnStatus = ADC_SAR_IP_STATUS_TIMEOUT;
    }
#if ADC_SAR_IP_HAS_BANDGAP_STATUS
    else
    {
        /* Wait for 20us after BandGap is OK */
        TimeoutTicks = OsIf_MicrosToTicks(ADC_SAR_IP_BANDGAP_TIMEOUT_VAL, ADC_SAR_IP_TIMEOUT_TYPE);
        CurrentTicks = OsIf_GetCounter(ADC_SAR_IP_TIMEOUT_TYPE);
        ElapsedTicks = 0u;
        while (ElapsedTicks < TimeoutTicks)
        {
            ElapsedTicks += OsIf_GetElapsed(&CurrentTicks, ADC_SAR_IP_TIMEOUT_TYPE);
        }
    }
#endif /* ADC_SAR_IP_HAS_BANDGAP_STATUS */

#if (1U == FEATURE_ADC_HAS_CLOCK_DIVIDER)
    if (ADC_SAR_IP_STATUS_SUCCESS == ReturnStatus)
    {
        /* Ensure the clock div is enabled because it was automatically disabled when entering power-down mode */
        Adc_Sar_EnableClkDiv(u32Instance, TRUE);
    }
#endif /* 1U == FEATURE_ADC_HAS_CLOCK_DIVIDER */

    return ReturnStatus;
}

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_Powerdown
* Description   : This function disables the ADC module (by setting the Powerdown
*  bit).
*
* @implements      Adc_Sar_Ip_Powerdown_Activity
* END**************************************************************************/
Adc_Sar_Ip_StatusType Adc_Sar_Ip_Powerdown(const uint32 u32Instance)
{
    const ADC_Type * AdcBasePtr = NULL_PTR;
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    const SAR_ADC_AE_Type * AdcAEBasePtr = NULL_PTR;
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    Adc_Sar_Ip_StatusType ReturnStatus = ADC_SAR_IP_STATUS_SUCCESS;

