rain-day27/S32K3_EB_Config/MCAL/Adc_TS_T40D34M50I0R0/src/Adc_Sar_Ip.c
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_32();
}
#endif /* (STD_ON == ADC_SAR_IP_WDG_ENABLED) */

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_SetConversionMode
* Description   : This function configures the used conversion mode.
* Note: The ADC instance must be in IDLE state in order to change this.
*
* @implements      Adc_Sar_Ip_SetConversionMode_Activity
* END**************************************************************************/
void Adc_Sar_Ip_SetConversionMode(const uint32 u32Instance,
                                  const Adc_Sar_Ip_ConvModeType eConvMode)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    SAR_ADC_AE_Type * AdcAEBasePtr = NULL_PTR;
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    volatile const uint32 * MSRAddr = NULL_PTR;
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */
    volatile uint32 * MCRAddr = NULL_PTR;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(u32Instance < ADC_SAR_IP_INSTANCE_COUNT);
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */
#if (ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)
    /* calibration must not be interrupted */
    if(FALSE == Adc_Sar_Ip_axAdcSarState[u32Instance].CalibrationOnGoing)
#endif /*(ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON) */
    {
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
        if (u32Instance >= ADC_INSTANCE_COUNT)
        {
            AdcAEBasePtr = Adc_Sar_AE_Ip_apxAdcBase[u32Instance - ADC_INSTANCE_COUNT];
#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
            MSRAddr = (volatile const uint32 *)&(AdcAEBasePtr->MSR);
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */
            MCRAddr = (volatile uint32 *)&(AdcAEBasePtr->MCR);
        }
        else
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
        {
            AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
            MSRAddr = (volatile const uint32 *)&(AdcBasePtr->MSR);
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */
            MCRAddr = (volatile uint32 *)&(AdcBasePtr->MCR);
        }

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
        /* The selected ADC should be in IDLE state */
        DevAssert(((*MSRAddr) & ADC_MSR_ADCSTATUS_MASK) == ADC_MSR_ADCSTATUS(ADC_SAR_IP_MSR_ADCSTATUS_IDLE));
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

        /* Edit MODE */
        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_19();
        switch (eConvMode)
        {
            case ADC_SAR_IP_CONV_MODE_ONESHOT:
                *MCRAddr &= ~(ADC_MCR_MODE(1u)); /* MODE = 0 */
                break;
            case ADC_SAR_IP_CONV_MODE_SCAN:
                *MCRAddr |= ADC_MCR_MODE(1u); /* MODE = 1 */
                break;
            default:
                ; /* no-op */
                break;
        }
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_19();
    }
}

#if ADC_SAR_IP_HAS_CTU
/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_SetCtuMode
* Description   : This function configures the CTU mode and enable.
*
* @implements      Adc_Sar_Ip_SetCtuMode_Activity
* END**************************************************************************/
Adc_Sar_Ip_StatusType Adc_Sar_Ip_SetCtuMode(const uint32 u32Instance,
                                            const Adc_Sar_Ip_CtuModeType eCtuMode)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    SAR_ADC_AE_Type * AdcAEBasePtr = NULL_PTR;
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    Adc_Sar_Ip_StatusType Status = ADC_SAR_IP_STATUS_SUCCESS;
    volatile uint32 * MCRAddr = NULL_PTR;

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(u32Instance < ADC_SAR_IP_INSTANCE_COUNT);
#if ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE
    DevAssert(!((FALSE == ADC_SAR_IP_INST_HAS_CTU_TRIGGER_MODE(u32Instance)) && (ADC_SAR_IP_CTU_MODE_TRIGGER == eCtuMode)));
#endif /*ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE*/
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */
#if (ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)
    /* calibration must not be interrupted */
    if(FALSE == Adc_Sar_Ip_axAdcSarState[u32Instance].CalibrationOnGoing)
    {
#endif /*(ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON) */
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
        if (u32Instance >= ADC_INSTANCE_COUNT)
        {
            AdcAEBasePtr = Adc_Sar_AE_Ip_apxAdcBase[u32Instance - ADC_INSTANCE_COUNT];
            MCRAddr = (volatile uint32 *)&(AdcAEBasePtr->MCR);
        }
        else
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
        {
            AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
            MCRAddr = (volatile uint32 *)&(AdcBasePtr->MCR);
        }

        /* Clear CTUEN to allow Powerdown operation to succeed. */
        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_20();
        *MCRAddr &= ~ADC_MCR_CTUEN_MASK;
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_20();

        /* Power down */
        Status = Adc_Sar_Ip_Powerdown(u32Instance);
        if (ADC_SAR_IP_STATUS_SUCCESS == Status)
        {
            /* Configure CTU */
#if ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE
            if (ADC_SAR_IP_INST_HAS_CTU(u32Instance))
            {
#endif /*ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE*/
                SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_20();
                switch (eCtuMode)
                {
                    case ADC_SAR_IP_CTU_MODE_CONTROL:
                        *MCRAddr &= ~(ADC_MCR_CTU_MODE(1U)); /* CTU_MODE = 0 */
                        *MCRAddr |= ADC_MCR_CTUEN(1U); /* CTUEN = 1 */
                        break;
#if ADC_SAR_IP_HAS_CTU_TRIGGER_MODE
                    case ADC_SAR_IP_CTU_MODE_TRIGGER:
                        /* Set CTU_MODE = 1 and CTUEN = 1 */
                        *MCRAddr |= (ADC_MCR_CTU_MODE(1U) | ADC_MCR_CTUEN(1U));
                        break;
#endif /* ADC_SAR_IP_HAS_CTU_TRIGGER_MODE */
                        /* Set CTU_MODE = 0 and CTUEN = 0 */
                    case ADC_SAR_IP_CTU_MODE_DISABLED:
                        *MCRAddr &= ~(ADC_MCR_CTU_MODE(1U) | ADC_MCR_CTUEN(1U));
                        break;
                    default:
                        ; /* no-op */
                        break;
                }
                SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_20();
#if ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE
            }
#endif /*ADC_SAR_IP_BAD_ACCESS_PROT_FEATURE*/

            /* Power up */
            Status = Adc_Sar_Ip_Powerup(u32Instance);
        }
#if (ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON)
    }
    else
    {
        Status = ADC_SAR_IP_STATUS_CAL_ONGOING;
    }
#endif /*(ADC_SAR_IP_ASYNC_CALIBARTION_ENABLED == STD_ON) */
    return Status;
}
#endif /* ADC_SAR_IP_HAS_CTU */

#if (ADC_SAR_IP_EXTERNAL_TRIGGER_ENABLE)
#if (FEATURE_ADC_HAS_INJ_EXT_TRIGGER || FEATURE_ADC_HAS_EXT_TRIGGER)
/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_SetExternalTrigger
* Description   : This function configures the external trigger.
*
* @implements      Adc_Sar_Ip_SetExternalTrigger_Activity
* END**************************************************************************/
void Adc_Sar_Ip_SetExternalTrigger(const uint32 u32Instance,
                                   const Adc_Sar_Ip_ExtTriggerEdgeType eTriggerEdge,
                                   const Adc_Sar_Ip_ExtTriggerSourceType eTrggerSrc)
{
#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(u32Instance < ADC_SAR_IP_INSTANCE_COUNT);
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

    /* Switch between injected and normal external trigger */
    switch (eTrggerSrc)
    {
#if FEATURE_ADC_HAS_EXT_TRIGGER
        case ADC_SAR_IP_NORMAL_EXT_TRIG:
            Adc_Sar_ConfigExternalTrigger(u32Instance, eTriggerEdge, ADC_MCR_EDGE_MASK, 0U, ADC_MCR_TRGEN_MASK);
            break;
#if FEATURE_ADC_HAS_AUX_EXT_TRIGGER
        case ADC_SAR_IP_AUX_NORMAL_EXT_TRIG:
            Adc_Sar_ConfigExternalTrigger(u32Instance, eTriggerEdge, ADC_MCR_EDGE_MASK, 0U, ADC_MCR_XSTRTEN_MASK);
            break;
        case ADC_SAR_IP_ALL_NORMAL_EXT_TRIG:
            Adc_Sar_ConfigExternalTrigger(u32Instance, eTriggerEdge, ADC_MCR_EDGE_MASK, ADC_MCR_EDGE_MASK, (ADC_MCR_TRGEN_MASK | ADC_MCR_XSTRTEN_MASK));
            break;
#endif /* FEATURE_ADC_HAS_AUX_EXT_TRIGGER */
#endif /* FEATURE_ADC_HAS_EXT_TRIGGER */
#if FEATURE_ADC_HAS_INJ_EXT_TRIGGER
        case ADC_SAR_IP_INJECTED_EXT_TRIG:
            Adc_Sar_ConfigExternalTrigger(u32Instance, eTriggerEdge, ADC_MCR_JEDGE_MASK, ADC_MCR_JEDGE_MASK, ADC_MCR_JTRGEN_MASK);
            break;
#endif /* FEATURE_ADC_HAS_INJ_EXT_TRIGGER */
        default:
            ; /* no-op */
            break;
    }
}
#endif /* (FEATURE_ADC_HAS_INJ_EXT_TRIGGER || FEATURE_ADC_HAS_EXT_TRIGGER) */
#endif /* (ADC_SAR_IP_EXTERNAL_TRIGGER_ENABLE) */

/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_SetUserGainAndOffset
* Description   : This function configures user gain and offset.
*
* @implements      Adc_Sar_Ip_SetUserGainAndOffset_Activity
* END**************************************************************************/
void Adc_Sar_Ip_SetUserGainAndOffset(const uint32 Instance,
                                     const uint16 Gain,
                                     const uint8 Offset)
{
    uint32 RegVal;
    ADC_Type * AdcBasePtr = NULL_PTR;
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    SAR_ADC_AE_Type * AdcAEBasePtr = NULL_PTR;
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    /* Write in RegVal the value needed for the register. */

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(Instance < ADC_SAR_IP_INSTANCE_COUNT);
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

#if FEATURE_ADC_HAS_APPLICATION_EXTENSION

    if (Instance >= ADC_INSTANCE_COUNT)
    {
        AdcAEBasePtr = Adc_Sar_AE_Ip_apxAdcBase[Instance - ADC_INSTANCE_COUNT];

        RegVal = ADC_AE_USER_OFFSET(Offset);
        RegVal |= ADC_AE_USER_GAIN(Gain);
        AdcAEBasePtr->ADC_AE_USER_OFFSET_GAIN_REG = RegVal;
    }
    else
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[Instance];

